<a href="https://colab.research.google.com/github/25prateek/google_colab/blob/master/panda.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
#reading data from a csv file
df=pd.read_csv('com.csv')

In [0]:
#data structure
df.info()
#df1=pd.read_csv('http://13.234.66.67/summer19/datasets/bank.csv')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [0]:
df

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [0]:
df.head(3) #top 3 rows
#df.tail(2) #top 2 rows

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [0]:
df['Name'] #perticular column

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [0]:
#for selecting rows and columns
df.iloc[0:,0:3]

            Name Department      Manager
0     Robin Hood        NaN          NaN
1  Arsene Wenger        Bar   Friar Tuck
2     Friar Tuck        Foo   Robin Hood
3    Little John        Foo   Robin Hood
4  Sam Allardyce        NaN          NaN
5  Dimi Berbatov        Foo  Little John

In [0]:
df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [0]:
)